#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

const ll MOD = (int)1e9 + 7;
ll mod(ll num) {
    num %= MOD;
    if (num < 0) num += MOD;
    return num;
}

void solve() {
    string s; cin >> s;
    int n; n = s.length();

    vector<int> lps(n + 5);
    vector<ll> cnt(n + 5);

    for (int i = 1, j = 0; i < n; ++i) {
        while (j && s[i] != s[j]) j = lps[j - 1];
        if (s[i] == s[j]) ++j;
        lps[i] = j;
        cnt[i] = 1 + cnt[j];
        cout << cnt[i] << " \n"[i == n - 1];
    }

    ll ans = 1;
    for (int i = 1, j = 0; i < n; ++i) {
        while (j && s[i] != s[j]) j = lps[j - 1];
        if (s[i] == s[j]) ++j;

        while (j && j > (i + 1) / 2) j = lps[j - 1];

        ans = mod(ans * (cnt[j] + 1));
    }

    cout << ans << '\n';
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/