#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int cnt;
    cin >> cnt;

    auto ask = [&](int num) -> int {
        cout << "- " << num << endl;
        int res; cin >> res;
        return res;
    };

    int n = 0;
    int sum = 0;
    int askn = 1;
    while (cnt) {
        assert(askn > 0);
        int ccnt = ask(askn);
        n += askn;

        if (ccnt == 0) break;

        assert(ccnt != -1);

        if (ccnt >= cnt) {
            int tmp = 0;
            for (int i = 0; i <=  ccnt - cnt; ++i) {
                tmp += (1 << (__lg(askn) + i));
            }
            
            n += tmp;
            if (ccnt - cnt + 1 == ccnt - sum)  {
                break;
            }

            sum += ccnt - cnt + 1;
            askn = (1 << (__lg(tmp) + 1));
        }
        else {
            askn = (1 << (__lg(askn) + 1));
        }

        cnt = ccnt;
    }

    cout << "! " << n << endl;
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/