#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;

    set<int> nums[2];
    for (int i = 1; i <= n; ++i) {
        nums[i & 1].insert(i);
    }

    auto erase = [&](int num) -> void {
        nums[num & 1].erase(num);
    };

    vector<int> res(1, n);
    erase(n);

    if (n & 1) {
        cout << n << '\n';
        res.push_back(n - 1);
        erase(n - 1);
    }
    else {
        int len = 0;
        while (n) {
            n >>= 1;
            ++len;
        }
        cout << (1 << len) - 1 << '\n';

        int tmp = (1 << (len - 1)) - 1;
        res.push_back(tmp);
        res.push_back(tmp - 1);
        erase(tmp);
        erase(tmp - 1);
    }

    for (auto i : nums[1]) {
        res.push_back(i);
    }
    for (auto i : nums[0]) {
        res.push_back(i);
    }

    for (int i = res.size() - 1; i >= 0; --i) {
        cout << res[i] << " \n"[i == 0];
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/