#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;
    vector a(n, vector<int>());

    int mxk = 0;
    for (int i = 0; i < n; ++i) {
        int k; cin >> k;
        mxk = max(mxk, k);
        for (int j = 0; j < k; ++j) {
            int num; cin >> num;
            a[i].push_back(num);
        }
    }

    int p = -1;
    vector<int> res;
    while (p + 1 < mxk) {
        ranges::sort(a);
        for (int i = 0; i < a[0].size(); ++i) {
            res.push_back(a[0][i]);
            ++p;
        }

        vector<vector<int>> tmp1;
        for (int i = 0; i < a.size(); ++i) {
            vector<int> tmp2;
            for (int j = a[0].size(); j < a[i].size(); ++j) {
                tmp2.push_back(a[i][j]);
            }

            if (!tmp2.empty()) {
                tmp1.push_back(tmp2);
            }
        }

        a = tmp1;
    }

    for (int i = 0; i < mxk; ++i) {
        cout << res[i] << " \n"[i == mxk - 1];
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/