#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;


void solve() {
    int n; cin >> n;
    vector e(n + 1, vector<int>());

    auto qu = [](int k) -> vector<int> {
        cout << "? " << k << '\n';
        cout.flush();
        int q; cin >> q;
        vector<int> vec(q);
        for (auto& i : vec) cin >> i;
        return vec;
    };

    vector<int> sz(n + 1, 0);
    auto cal = [&](auto& cal, int u) -> void {
        if (sz[u]) return;
        sz[u] = 1;
        for (auto v : e[u]) {
            cal(cal, v);
            sz[u] += sz[v];
        }
        return;
    };

    
    int ans = 0;
    vector<int> pre(1, 1);
    int k = 2;

    while (1) {
        vector<int> path = qu(k);
        
        if (path.size() == 0) {
            break;
        }

        int pos = 0;
        while (pos < min(path.size(), pre.size()) && path[pos] == pre[pos]) {
            ++pos; 
        }

        
        if (pos && pos < path.size()) {
            int u = path[pos - 1];
            int v = path[pos];

            e[u].push_back(v);
            ++ans;
        }
        
        if (pos < pre.size()) {
            cal(cal, pre[pos]);
        }

        int size = sz[path[pos]];
        k += max(1, size);
        pre = path;
        // cout << pos << ' ' << size << ' ' << sz[pre[pos]] << '\n';
    }

    cout << "! " << ans << '\n';
    for (int i = 1; i <= n; ++i) {
        for (auto v : e[i]) {
            cout << i << ' ' << v << '\n';
        }
    }
    cout.flush();
}

int main() {
    
    // __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/