//https://codeforces.com/problemset/problem/2194/C

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, k;
    cin >> n >> k;

    vector<string> s(k);
    for(int i = 0; i < k; ++i) {
        cin >> s[i];
    }

    vector cnt(n, vector<int> (26, 0));
    for (int i = 0; i < k; ++i) {
        for (int j = 0; j < n; ++j) {
            ++cnt[j][s[i][j] - 'a'];
        }
    }

    set<int> st;
    for (int i = 1; i * i <= n; ++i) {
        if (n % i == 0) {
            st.insert(i);
            st.insert(n / i);
        }
    }

    for (auto d : st) {
        string s;
        for (int k = 0; k < d; ++k) {
            int ccnt[26] = {0};
            for (int i = k; i < n; i += d) {
                for (int j = 0; j < 26; ++j) {
                    if (cnt[i][j]) ++ccnt[j];
                }
            }
            int f = 0;
            for (int i = 0; i < 26; ++i) {
                if (ccnt[i] == n / d) {
                    s.push_back(i + 'a');
                    break;
                }

                if (i == 25) {
                    f = 1;
                }
            }
            if (f) break;
        }

        if (s.length() == d) {
            for (int i = 0; i < n / d; ++i) {
                cout << s;
            }
            cout << '\n';
            return;
        }
    }

    cout << "error\n";
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
