#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;
    vector<int> a(n + 2);

    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
    }

    stack<int> st;
    vector<int> pre(n + 2), sub(n + 2);
    for (int i = 1; i <= n; ++i) {
        while (st.size() && a[st.top()] >= a[i]) {
            st.pop();
        }
        if (st.empty()) {
            pre[i] = i - 1;
        }
        else {
            pre[i] = i - st.top() - 1;
        }
        st.push(i);
        // cout << pre[i] << " \n"[i == n];
    }

    while (st.size()) st.pop();
    for (int i = n; i > 0; --i) {
        while (st.size() && a[st.top()] >= a[i]) {
            st.pop();
        }
        if (st.empty()) {
            sub[i] = n - i;
        }
        else {
            sub[i] = st.top() - i - 1;
        }
        st.push(i);
        // cout << sub[i] << " \n"[i == 1];
    }

    vector<int> cnt(n + 1, 0);
    for (int i = 1; i <= n; ++i) {
        cnt[a[i]] = max(cnt[a[i]], pre[i] + sub[i] + 1);
    }

    vector<int> ans(n + 1);
    for (int i = 1; i <= n; ++i) {
        if (cnt[i] == n - i + 1) {
            ans[n - i + 1] = 1;
        }
        else {
            break;
        }
    }

    for (int i = 1; i <= n; ++i) {
        if (cnt[i] == 0) break;
        if (i == n) {
            ans[1] = 1;
        }
    }

    for (int i = 1; i <= n; ++i) {
        cout << ans[i];
    }
    cout << '\n';
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/