#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

const ll MOD = 998244353;

void solve() {
    int n; cin >> n;
    string s, t;
    cin >> s >> t;

    int p = 0;
    vector<int> fa(n + 1);
    vector e1(n + 1, vector<int>());
    for (int i = 0; i < n; ++i) {
        if (s[i] == '(') {
            e1[p].push_back(i + 1);
            fa[i + 1] = p;
            p = i + 1;
        }
        else {
            p = fa[p];
        }
    }

    fa.assign(n + 1, 0);
    vector e2(n + 1, vector<int>());
    for (int i = 0; i < n; ++i) {
        if (t[i] == '(') {
            e2[p].push_back(i + 1);
            fa[i + 1] = p;
            p = i + 1;
        }
        else {
            p = fa[p];
        }
    }

    auto bfs = [](vector<vector<int>> & e) -> int {
        queue<int> qu;
        qu.push(0);

        int cnt = 0;
        int len = 0;
        while (!qu.empty()) {
            int u = qu.front();
            qu.pop();
            for (auto v : e[u]) {
                if (e[v].empty()) {
                    ++cnt;
                }
                else {
                    qu.push(v);
                }
            }
        }

        return cnt;
    };
    
    auto cal = [](vector<vector<int>> & e) -> int {
        int p = 0;
        int cnt = 0;
        while (e[p].size() == 1) {
            ++cnt;
            p = e[p][0];
        }
        return cnt;
    };

    if (bfs(e1) == bfs(e2) && cal(e1) == cal(e2)) {
        cout << "YES\n";
    }
    else {
        cout << "NO\n";
    }
}

int main() {
    
    __BUFF__
 
    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/