//https://codeforces.com/problemset/problem/2181/B

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m;
    cin >> n >> m;

    priority_queue<int> a, b;
    for (int i = 0; i < n; ++i) {
        int num; cin >> num;
        a.push(num);
    }

    for (int i = 0; i < m; ++i) {
        int num; cin >> num;
        b.push(num);
    }

    int tag = 1;

    // while (!a.empty()) {
    //     cout << a.top() << ' ';
    //     a.pop();
    // }
    while (!a.empty() && !b.empty()) {       

        if (tag) {
            if (b.top() <= a.top()) {
                b.pop();
            }
            else {
                b.push(b.top() - a.top());
                b.pop();
            }
        }
        else {
            if (a.top() <= b.top()) {
                a.pop();
            }
            else {
                a.push(a.top() - b.top());
                a.pop();
            }
        }

        tag ^= 1;
    }

    if (a.empty()) {
        cout << "Bob\n";
    }
    else {
        cout << "Alice\n";
    }
} 

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
