//https://codeforces.com/problemset/problem/2181/A

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m;
    cin >> n >> m;

    vector<int> cnt(26, 0);

    vector<string> s(n);
    for (int i = 0; i < n; ++i) {
        cin >> s[i];
        for (auto ss : s[i]) {
            // cout << ss - 'A' << ' ';
            ++cnt[ss - 'A'];
        }
        // cout << '\n';
    }

    for (int i = 0; i < n; ++i) {
        map<int, int> ccnt;
        for (auto ss : s[i]) {
            ++ccnt[ss - 'A'];
        }

        int tag = 0;
        int ans = 0;
        for (auto [ch, num] : ccnt) {
            if (num == cnt[ch]) {
                // cout << "fk1\n";
                tag = 1;
                break;
            }
            else {
                int temp = (cnt[ch] - 1) / (cnt[ch] - num);
                if (temp > m) {
                    // cout << "fk2\n";
                    // cout << temp << ' ' << m << ' ' << num << '\n';
                    tag = 1; 
                    break;
                }
                if (i == 2 && temp == 1) {
                    // cout << '\n' << ch << ' ' << cnt[ch] << ' ' << num << '\n';
                }
                ans = max(temp, ans);
            }
        }

        if (tag) cout << "-1 ";
        else cout << m - ans << ' ';
    }
} 

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
