#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;
    string s; cin >> s;

    s = ' ' + s;

    int sum1 = 0, cnt1 = 0;
    int sum2 = 0, cnt2 = 0;

    for (int i = 1; i <= n; ++i) {
        if (i <= n / 2) {
            if (s[i] == '?')  {
                ++cnt1;
            }
            else {
                sum1 += s[i] - '0';
            }
        }
        else {
            if (s[i] == '?')  {
                ++cnt2;
            }
            else {
                sum2 += s[i] - '0';
            }
        }
    }

    int cnt = abs(cnt1 - cnt2);
    if (cnt1 > cnt2) swap(sum1, sum2);

    if (sum1 < sum2) {
        cout << "Monocarp";
        return;
    }

    int sum = sum1 - sum2;
    if (sum == 9 * cnt / 2) {
        cout << "Bicarp";
    }
    else {
        cout << "Monocarp";
    }

}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/