#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, q; 
    cin >> n >> q;

    vector<int> r(n + 1), c(n + 1);
    vector<int> rr(n + 2), cc(n + 2);

    for (int i = 1; i <= n; ++i) {
        cin >> r[i];
        rr[i] = rr[i - 1] + (r[i] & 1);
    }

    for (int i = 1; i <= n; ++i) {
        cin >> c[i];
        cc[i] = cc[i - 1] + (c[i] & 1);
    }

    while (q--) {
        int ra, ca, rb, cb;
        cin >> ra >> ca >> rb >> cb;
        
        if (ra > rb) swap(ra, rb);
        int rodd = rr[rb] - rr[ra - 1];

        if (ca > cb) swap(ca, cb);
        int codd = cc[cb] - cc[ca - 1];

        if (codd && codd != cb - ca + 1) {
            cout << "NO\n";
        }
        else if (rodd && rodd != rb - ra + 1) {
            cout << "NO\n";
        }
        else {
            cout << "YES\n";
        }
    }

}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/