#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m;
    cin >> n >> m;

    vector<int> x(n + 1);

    for (int i = 1; i <= n; ++i) {
        cin >> x[i];
    }

    sort(x.begin() + 1, x.end());
    multiset<arr2> st;

    auto cal_l = [&](int i) -> arr2 {
        if (i == 1) return {x[1], (int)-2e9};
        int dis = x[i] - x[i - 1] - 1;
        return {x[i], x[i] - (dis + 1) / 2};
    };

    auto cal_r = [&](int i) -> arr2 {
        if (i == n) return {x[n], (int)2e9};
        int dis = x[i + 1] - x[i] - 1;
        return {x[i], x[i] + (dis / 2)};
    };

    for (int i = 1; i <= n; ++i) {
        arr2 tmp = cal_l(i);
        if (tmp[0] != tmp[1]) st.insert(tmp);

        tmp = cal_r(i);
        if (tmp[0] != tmp[1]) st.insert(tmp);
    }

    ll ans = 0;
    int dis = 0;
    vector<int> y;

    while (y.size() < m) {
        ++dis;

        // b <-- a --> b
        auto it = st.begin();
        while (it != st.end()) {
            auto [a, b] = *it;

            // cout << a << ' ' << b << '\n';
            int p = a;
            if (a < b) p += dis;
            else p -= dis;

            ans += dis;
            y.push_back(p);
            if (y.size() == m) break;

            if (p == b) {
                it = st.erase(it);
            }
            else {
                ++it;
            }
        }

        // cout << "dis =  " << dis << ' ';
        // for (auto i : y) {
        //     cout << i << ' ';
        // }
        // cout << '\n';
    }

    cout << ans << '\n';
    for (int i = 1; i <= m; ++i) {
        cout << y[i - 1] << " \n"[i == m];
    }
}

int main() {

    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}

/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/