#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m, q;
    cin >> n >> m >> q;

    vector<arr2> seg({{1, -q},  {m, m}, {n + q + 1, n}});

    for (int i = 1; i <= q; ++i) {
        int x; cin >> x;
        bool f = 0;

        for (auto& [l, r] : seg) {
            if (x < l) {
                l = max(l - 1, 1);
            }
            else if (x > r) {
                r = min(r + 1, n);
            }
            else {
                f = 1;
                if (l == r) r = -q, l = n + q;
            }
        }

        if (f) {
            seg[0] = {1, max(1, seg[0][1])};
            seg[2] = {min(n, seg[2][0]), n};
        }

        int ll = 0; int rr = -1;
        int sum = 0;

        for (auto [l, r] : seg) {
            if (l > r) continue;
            if (l > rr) {
                sum += max(rr - ll + 1, 0);
                ll = l;
                rr = r;
            }
            rr = max(rr, r);    
        }

        sum += max(0, rr - ll + 1);
        cout << sum << " \n"[i == q];
    }
} 

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/