#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);
const int inf = 0x3f3f3f3f;

void solve() {
    int n, m, k, s;
    cin >> n >> m >> k >> s;

    vector dis(n + 1, vector<int>(k + 1, inf));
    vector<int> a(n + 1);

    for (int i = 1; i <= n; ++i) {
        cin >> a[i];

        assert(a[i] < dis[i].size());
        dis[i][a[i]] = 0;
    }

    vector e(n + 1, vector<int>());
    for (int i = 0; i < m; ++i) {
        int u, v; cin >> u >> v;
        e[u].push_back(v);
        e[v].push_back(u);
    }
 
    vector<int> vis(n + 1);
    auto bfs = [&](int s) -> void {
        queue<int> qu;

        for (int i = 1; i <= n; ++i) {
            if (a[i] == s) {
                qu.push(i);
                vis[i] = s;
            }
        }

        while (!qu.empty()) {
            int u = qu.front();
            qu.pop();

            for (auto v : e[u]) {
                if (vis[v] == s) continue;
                vis[v] = s;
                dis[v][s] = dis[u][s] + 1;
                qu.push(v);
            }
        }
    };
    
    for (int i = 1; i <= k; ++i) {
        bfs(i);
    }

    for (int i = 1; i <= n; ++i) {

        sort(dis[i].begin() + 1, dis[i].end());
        ll sum = 0;

        for (int j = 1; j <= s; ++j) {
            sum += dis[i][j];
        }

        cout << sum << " \n"[i == n];
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/