#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int m, q;
    cin >> m >> q;

    string s; cin >> s;
    int len = s.length();

    vector<string> ss(m);
    vector pre(m, vector<int>(len + 5, 0));

    for (int i = 0; i < m; ++i) {
        cin >> ss[i];

        int len1 = ss[i].length();
        vector<int> lps(len1 + 5);

        for (int l = 0, r = 1; r < len1; ++r) {
            while (l && ss[i][l] != ss[i][r]) l = lps[l - 1];
            if (ss[i][l] == ss[i][r]) ++l;
            lps[r] = l;
        }

        for (int k = 0, j = 0; k < len; ++k) {
            while (j && s[k] != ss[i][j]) j = lps[j - 1];
            if (s[k] == ss[i][j]) ++j;
            if (j == len1) {
                pre[i][k + 1] = 1;
                j = lps[j - 1];
            } 
        }

        for (int j = 1; j <= len; ++j) {
            pre[i][j] += pre[i][j - 1];
        }
    }

    for (int i = 0; i < q; ++i) {
        int l, r;
        cin >> l >> r;

        int sum = 0;
        for (int j = 0; j < m; ++j) {
            len = ss[j].length();
            int ll = l + len - 1;

            if (ll > r) continue;
            sum += pre[j][r] - pre[j][ll - 1];
        }
        cout << sum << '\n';
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/