//https://codeforces.com/problemset/problem/2194/E

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m; cin >> n >> m;

    vector a(n + 2, vector<ll> (m + 2));
    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            cin >> a[i][j];
        }
    }

    vector dp1(n + 2, vector<ll> (m + 2, -1e10));
    vector dp2(n + 2, vector<ll> (m + 2, -1e10));
    dp1[1][1] = a[1][1];

    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            if (i == 1 && j != 1) {
                dp1[i][j] = dp1[i][j - 1] + a[i][j];
            }
            else if (j == 1 && i != 1) {
                dp1[i][j] = dp1[i - 1][j] + a[i][j];
            }
            else {
                dp1[i][j] = max(dp1[i][j], dp1[i - 1][j] + a[i][j]);
                dp1[i][j] = max(dp1[i][j], dp1[i][j - 1] + a[i][j]);                
            }
        }
    }

    dp2[n][m] = a[n][m];
    for (int i = n; i > 0; --i) {
        for (int j = m; j > 0; --j) {
            if (i == n && j != m) {
                dp2[i][j] = dp2[i][j + 1] + a[i][j];
            }
            else if (j == m && i != n) {
                dp2[i][j] = dp2[i + 1][j] + a[i][j];
            }
            else {
                dp2[i][j] = max(dp2[i][j], dp2[i + 1][j] + a[i][j]);
                dp2[i][j] = max(dp2[i][j], dp2[i][j + 1] + a[i][j]);                
            }
        }
    }

    auto cal = [&](int i, int j) -> ll {
        return dp1[i][j] + dp2[i][j] - a[i][j];
    };

    vector ddp1(n + 2, vector<ll> (m + 2, -1e10));//hang
    vector ddp2(n + 2, vector<ll> (m + 2, -1e10));//lie
    ddp1[1][1] = ddp2[1][1] = cal(1, 1);
    

    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            ddp1[i][j] = ddp2[i][j] = cal(i, j);
            if (j != 1) {
                ddp1[i][j] = max(ddp1[i][j], ddp1[i][j - 1]);
            }
            if (i != 1) {
                ddp2[i][j] = max(ddp2[i][j], ddp2[i - 1][j]);
            }
        }
    }

    auto print = [&](vector<vector<ll>>& vec) -> void {
        for (auto vvec : vec) {
            for (auto i : vvec) {
                if (i == -1e10) continue;
                cout << i << ' ';
            }
            cout << '\n';
        }
        cout << "-----------\n";
    };

    // print(dp1);
    // print(dp2);
    // print(ddp1);
    // print(ddp2);

    // cout << cal(n, m) << '\n';
    ll ans = cal(n, m);
    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            if (cal(i, j) == cal(n, m)) {
                ll temp = cal(i, j) - 2 * a[i][j];
                
                if (i - 1 > 0 && j + 1 <= m) 
                    temp = max(temp, ddp2[i - 1][j + 1]);
                if (i + 1 <= n && j - 1 > 0) 
                    temp = max(temp, ddp1[i + 1][j - 1]);

                // cout << "i, j : " << i << ' ' << j << '\n';
                // cout << "temp = " << temp << '\n';
                ans = min(ans, temp);
            }
        }
    }

    cout << ans << '\n';
} 

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
