#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m, k;
    cin >> n >> m >> k;

    vector<string> a(n + 2);
    vector sum(n + 2, vector<int>(m + 2));
    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
        a[i] = ' ' + a[i];
        for (int j = 1; j <= m; ++j) {
            if (a[i][j] == 'g') {
                sum[i][j] = 1;
            }
            sum[i][j] += sum[i - 1][j] + sum[i][j - 1];
            sum[i][j] -= sum[i - 1][j - 1];
        }
    }

    auto cal = [&](int i, int j) -> int {
        int x1 = min(i + k - 1, n);
        int y1 = min(j + k - 1, m);

        int x2 = max(i - k, 0);
        int y2 = max(j - k, 0);

        int ans =  sum[x1][y1];
        ans -= sum[x1][y2];
        ans -= sum[x2][y1];
        ans += sum[x2][y2];

        return ans;
    };

    int mn = sum[n][m];
    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            if (a[i][j] == '.') {
                mn = min(cal(i, j), mn);
                // cout << i << ' ' << j << '\n';
                // cout << cal(i, j) << '\n';
            }
            // cout << sum[i][j] << " \n"[j == m];
        }
    }

    cout << sum[n][m] - mn << '\n';
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/