#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<ll, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, m, k;
    cin >> n >> m >> k;

    vector<int> a(n + 1);
    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
    }

    ll ans = 0;
    vector<int> mp(k + 1, 0);
    auto add = [&](int& p, int dir) -> void {
        p += dir;
        int num = mp[a[p]];
        ans += num * 2ll + 1ll;
        ++mp[a[p]];
    };

    auto del = [&](int& p, int dir) -> void {
        int num = mp[a[p]];
        ans += 1ll - num * 2ll;
        --mp[a[p]];
        p += dir;
    };

    vector<arr3> q(m);
    for (int i = 0; i < m; ++i) {
        cin >> q[i][0] >> q[i][1];
        q[i][2] = i;
    }

    int block = ceil(sqrt(n));
    auto cmp1 = [&](arr3 x, arr3 y) -> bool {
        int idx1 = x[0] / block;
        int idx2 = y[0] / block;
        if (idx1 == idx2) {
            if (idx1 & 1) {
                return x[1] > y[1];
            }
            return x[1] < y[1];
        }
        return idx1 < idx2;
    };

    ranges::sort(q, cmp1);

    mp[a[1]] = 1;
    ans = 1;
    int l = 1, r = 1;
    vector<arr2> res(m);
    for (int i = 0; i < m; ++i) {
        while (l < q[i][0]) del(l, 1);
        while (l > q[i][0]) add(l, -1);
        while (r < q[i][1]) add(r, 1);
        while (r > q[i][1]) del(r, -1);
        res[i][0] = q[i][2];
        res[i][1] = ans;
        // cout << l / block << ' ' << l << ' ' << r << ' ' << ans << '\n';
    }

    ranges::sort(res);
    for (auto [i, num] : res) {
        cout << num << '\n';
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/ 