//https://codeforces.com/problemset/problem/2192/C

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    ll n, h, k;
    cin >> n >> h >> k;

    vector<ll> a(n + 1), pre(n + 1);

    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
        pre[i] = pre[i - 1] + a[i];
    }

    int temp = h / pre[n];
    h %= pre[n];
    ll ans = temp * n + max(temp - 1, 0) * k;
    if (h == 0) {
        cout << ans << '\n';
        return;
    }
    else if (ans){
        ans += k;
    }

    int p = upper_bound(pre.begin() + 1, pre.end(), h) - pre.begin();
    --p;
    
    ll mx = 0;
    for (int i = p + 1; i <= n; ++i) {
        mx = max(mx, a[i]);
    }

    // cout << mx << '\n';
    temp = INT_MAX;
    for (int i = 1; i <= p; ++i) {
        if (a[i] >= mx) continue;
        int pp = lower_bound(pre.begin() + 1, pre.end(), h - mx + a[i]) - pre.begin();
        // if (pp < i) continue;
        pp = max(pp, i); 
        // cout << i << ' ' << pp << '\n';
        temp = min(temp, pp);
    }
    p = lower_bound(pre.begin(), pre.end(), h) - pre.begin();
    p = min(p, temp);

    // cout << ans << ' ' << p << '\n';
    cout << ans + p << '\n';
} 

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
