#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;
    vector<ll> a(n + 1);
    vector<ll> pre(n + 1), suf(n + 3);

    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
        pre[i] = abs(a[i]);
        pre[i] += pre[i - 1];
    }

    for (int i = n; i > 0; --i) {
        suf[i] = suf[i + 1] + a[i];
    } 

    int tag = 0;
    ll mx = suf[1];
    for (int i = 1; i <= n; ++i) {
        if (a[i] > 0 && mx < pre[i - 1] - a[i] + suf[i + 1]) {
            tag = i;
            mx = pre[i - 1] - a[i] + suf[i + 1];
        }
    }

    if (tag) {
        vector<int> ans;
        int f = 1;
        for (int i = tag - 1; i > 0; --i) {
            if ((a[i] > 0 && f) || (a[i] < 0 && !f)) {
                f ^= 1;
                ans.push_back(i);
            }
        }
        ans.push_back(tag);

        cout << ans.size() << '\n';
        for (auto i : ans) {
            cout << i << ' ';
        }
        cout << '\n';
    }
    else {
        cout << 0 << '\n';
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/