#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n, k; cin >> n >> k;
    int cnt[4] = {};
    vector a(n, vector<int>(k));
    int tag = 0;
    vector<int> b(16);

    for (int i = 0; i < n; ++i) {
        int num = 0;
        int sum = 0;
        for (int j = 0; j < k; ++j) {
            cin >> a[i][j];
            cnt[j] += a[i][j];
            sum += a[i][j];
            if(a[i][j]) num += (1 << j);
        }
        if (num == 0 || sum == 1) tag = 1;
        b[num] = 1;
    }

    // cout << cnt[0] << ' ' << cnt[1] << ' ' << cnt[2] << ' ' << cnt[3]<< '\n';
    if (cnt[0] == n || cnt[1] == n || cnt[2] == n || cnt[3] == n) {
        cout << "NO\n";
        return;
    }

    if (tag) {
        cout << "YES\n";
        return;
    }

    auto cal = [](int num) -> int {
        int cnt = 0;
        while (num) {
            if (num & 1) ++cnt;
            num >>= 1;
        }
        return cnt;
    };

    for (int i = 3; i < 16; ++i) {
        if (b[i] && b[((1 << k) - 1) ^ i] && cal(i) == 2) {
            cout << "YES\n";
            return;
        }
    }

    cout << "NO\n";
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/