//https://codeforces.com/problemset/problem/2203/D

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);


void solve() {
    int m, n;
    cin >> n >> m;

    vector<int> a(n + 1), b(m + 1);
    vector<int> cnt(n + m + 1);
    
    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
        ++cnt[a[i]];
    }

    for (int i = 1; i <= m; ++i) {
        cin >> b[i];
    }

    vector<int> ccnt(n + m + 1);

    for (int i = 1; i <= n + m; ++i) {
        if (cnt[i] == 0) continue;
        for (int j = 1; j * i <= n + m; ++j) {
            ccnt[i * j] += cnt[i];
        }
    }

    int ans[3] = {};
    for (int i = 1; i <= m; ++i) {
        int tmp = ccnt[b[i]];

        if (tmp == n) {
            ++ans[0]; // A
        }
        else if (tmp == 0) {
            ++ans[2]; // B
        }
        else {
            ++ans[1]; // A & BS
        }
    }

    ans[0] += (ans[1] % 2);

    // cout << cnt[0] << ' ' << cnt[2] << '\n';
    if (ans[0] > ans[2]) {
        cout << "Alice\n";
    }
    else {
        cout << "Bob\n";
    }
} 

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
