#include <bits/stdc++.h>
#include <cassert>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;
    string s; cin >> s;
    vector<int> cnt(26);

    list<arr3> a;
    a.push_back({s[0] - 'a', -1, 0});

    for (int i = 1; i < n; ++i) {
        int ch = s[i] - 'a';

        int tag = -1;
        auto it = a.end();
        while (it != a.begin() && (*prev(it))[0] > ch) {
            it = prev(it);
            if ((*it)[1] != -1) {
                if (tag != -1 && tag != (*it)[1]){
                    cout << "NO\n";
                    return;
                }
                else tag = (*it)[1];
            }
        }

        a.insert(it, {ch, -1, i});
        it = prev(it);
        
        if (it != prev(a.end())) {
            // cout << "fking in here??\n";
            if (tag != -1) {
                (*it)[1] = tag ^ 1;
            }
            else {
                (*it)[1] = 0;
                tag = 1;
            }

            while (next(it) != a.end()) {
                it = next(it);
                (*it)[1] = tag;
            }
        }
    }

    vector<int> ans(n);
    for (auto [num, tag, p] : a) {
        ans[p] = tag;
    }

    cout << "YES\n";
    for (auto i : ans) {
        if (~i) cout << i;
        else cout << 0;
    }
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/