#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

#include <bits/extc++.h>
using namespace __gnu_pbds;

using namespace std;
using ll = long long;
using uint = uint32_t; 
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    int n; cin >> n;
    vector<int>  s(n + 1), p(n + 1);

    vector e(n + 1, vector<int>());
    for (int i = 2; i <= n; ++i) {
        cin >> p[i];
        e[p[i]].push_back(i);
    }

    for (int i = 1; i <= n; ++i) {
        cin >> s[i];
    }

    bool f = 1;
    auto dfs = [&](auto&& dfs, int u, int mx, int h) -> void {
        if (f == 0) return;

        if ((h & 1) && s[u] == -1) {
            f = 0;
            return;
        }

        if ((h % 2 == 0) && s[u] != -1) {
            f = 0;
            return;
        }

        if (h & 1) {
            if (s[u] < mx) {
                f = 0;
                return;
            }
            else {
                mx = s[u];
            }
        }
        else {
            int mn = 1e9;
            for (auto v : e[u]) {
                mn = min(mn, s[v]); 
            }
            if (mn == 1e9) {
                mn = s[p[u]];
            }

            s[u] = mn;
        }

        for (auto v : e[u]) {
            dfs(dfs, v, mx, h + 1);
        }
        

        s[u] -= s[p[u]];
    };

    dfs(dfs, 1, 0, 1);

    if (f == 0) {
        cout << "-1\n";
        return;
    }

    ll sum = 0;
    for (int i = 1; i <= n; ++i) {
        // cout << i << ": " << s[i]  << '\n';
        sum += s[i];
    }

    cout << sum << '\n';
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/