#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<int, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    ll n, m;
    cin >> n >> m;
    
    auto mod = [&](ll num) -> int {
        num %= m;
        if (num < 0) num += m;
        return num;
    };

    vector<int> a(n + 1);
    vector<int> pre(n + 1);
    for (int i = 1; i <= n; ++i) {
        cin >> a[i];
        pre[i] = pre[i - 1] ^ a[i];
    }

    auto cal = [&](int l, int r) -> int {
        return pre[r] ^ pre[l - 1];
    };

    // 右端点为 i ^和 <= j 的最大划分数
    vector dp(n + 1, vector<int>(4100));

    // 右端点为 i ^和 <= j 且取到最大划分下的方案数量
    vector ddp(n + 1, vector<int>(4100));

    for (int i = 1; i <= n; ++i) {
        dp[i][cal(1, i)] = 1;
        ddp[i][cal(1, i)] = 1;

        for (int j = i; j > 1; --j) {      
            int v = cal(j, i);      
            if (dp[j - 1][v]) {

                if (dp[i][v] < dp[j - 1][v] + 1) {
                    dp[i][v] = dp[j - 1][v] + 1;
                    ddp[i][v] = ddp[j - 1][v];
                }
                else if (dp[i][v] == dp[j - 1][v] + 1) {
                    ddp[i][v] = mod((ll)ddp[i][v] + ddp[j - 1][v]);
                }
            }
        }

        for (int j = 1; j <= 4096; ++j) {

            if (dp[i][j] < dp[i][j - 1]) {
                dp[i][j] = dp[i][j - 1];
                ddp[i][j] = ddp[i][j - 1];
            } 
            else if (dp[i][j - 1] == dp[i][j] && dp[i][j] > 0) {
                ddp[i][j] = mod((ll)ddp[i][j] + ddp[i][j - 1]);
            }
        }
    }

    cout << dp[n][4096] << ' ' << ddp[n][4096];
}

int main() {
    
    __BUFF__

    int _ = 1;
    // cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░
*/