//https://codeforces.com/problemset/problem/2197/C

#include <bits/stdc++.h>
#define __BUFF__ ios::sync_with_stdio(false);cin.tie(0);

using namespace std;
using ll = long long;
using uint = uint32_t;
using ull = uint64_t;
using arr2 = array<ll, 2>;
using arr3 = array<int, 3>;
const double PI = acos(-1.0);

void solve() {
    ll p, q; cin >> p >> q;

    auto f = [&](ll fac) -> arr2 {
        return {fac * 2, fac * 3};
    };

    ll fac = p / 2;
    arr2 dif = f(fac);
    if (dif[1] > q) {
        fac = q / 3;
        dif = f(fac);
    }

    if (fac == 0) {
        cout << "Alice\n";
        return;
    }

    dif[0] = p - dif[0];
    dif[1] = q - dif[1];

    if (dif[0] < dif[1]) {
        cout << "Alice\n";
        return;
    }

    if (dif[0] == dif[1] || dif[0] - dif[1] < fac) {
        cout << "Bob\n";
        return;
    }
    cout << "Alice\n";
    // cout <<fac << ' ' << dif[0] << ' ' << dif[1] << '\n';
} 

int main() {
    
    __BUFF__

    int _ = 1;
    cin >> _;

    while (_--) {
        solve();
        // cout << "-----------\n";
    }

    return 0;
}
/*
 ███████████  ███████████ ██████████ ███████████      ███████      █████████    █████████   ███████████   █████ █████ ███████████
░░███░░░░░███░█░░░███░░░█░░███░░░░░█░░███░░░░░███   ███░░░░░███   ███░░░░░███  ███░░░░░███ ░░███░░░░░███ ░░███ ░░███ ░█░░░░░░███ 
 ░███    ░███░   ░███  ░  ░███  █ ░  ░███    ░███  ███     ░░███ ███     ░░░  ░███    ░███  ░███    ░███  ░░███ ███  ░     ███░  
 ░██████████     ░███     ░██████    ░██████████  ░███      ░███░███          ░███████████  ░██████████    ░░█████        ███    
 ░███░░░░░░      ░███     ░███░░█    ░███░░░░░███ ░███      ░███░███          ░███░░░░░███  ░███░░░░░███    ░░███        ███     
 ░███            ░███     ░███ ░   █ ░███    ░███ ░░███     ███ ░░███     ███ ░███    ░███  ░███    ░███     ░███      ████     █
 █████           █████    ██████████ █████   █████ ░░░███████░   ░░█████████  █████   █████ █████   █████    █████    ███████████
░░░░░           ░░░░░    ░░░░░░░░░░ ░░░░░   ░░░░░    ░░░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░   ░░░░░    ░░░░░    ░░░░░░░░░░░ 

*/
